# TextDistToLine Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextDistToLine Property
ParameterTypeId Class See Also
---
"Text Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextDistToLine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextDistToLine As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextDistToLine {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace